<template>
	<div class="">
		<div v-if="!isWeixin" style="position: fixed;left:0;right:0;">
			<MyHeader :title="'注册协议'"></MyHeader>
		</div>
		<div class="contain">
			<MyHeader :title="''" v-if="!isWeixin"></MyHeader>
			<h2>19理财用户注册协议</h2>
		<h3>在成为19理财网用户前请务必仔细阅读并同意本协议规则。</h3>
        <h3>1. 注册提示</h3>
        <p>1.1 19理财网同意按照本协议的规定及其不时发布的操作规则提供基于互联网及相关产品的服务（下称"相关服务"），为获得相关服务，服务使用人（下称"用户"）应当同意本协议的全部条款并按照页面上的提示完成全部的注册程序。用户在进行注册程序过程中点击"同意"按钮即表示用户完全接受本协议项下的全部条款。</p>
		<p>1.2用户定义 <br/>
用户必须是（年龄满18—65周岁之间）具备完全民事行为能力的自然人；无民事行为能力人、限制民事行为能力人不应当注册为19理财网用户或超过其民事权利或行为能力范围从事信息发布、交易的，其与19理财网之间的服务协议自始无效，网站一经发现，有权立即注销该用户，并追究其使用19理财网"服务"的一切法律责任。
用户按照注册程序注册成功后，将对用户名和密码安全承担全部责任。用户可随时根据提示改变用户的密码。用户不应将其帐号、密码转让或出借于他人使用。如用户发现其帐号遭他人非法使用或存在安全漏洞的情况，应立即通知19理财网。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，19理财网不承担任何责任。
		</p>

		<h3>2. 服务内容及相应要求</h3>
		<p>2.1 19理财网为有借款需求客户和资金提供方（贷出者）的信息对接平台以及获取各类与投融资相关的服务信息的地点。19理财网会对客户的身份信息的真实性进行审核但不能完全控制双方交易所涉及的服务的质量、安全或合法性，信息的真实性或准确性，以及交易方履行其在协议项下的各项义务的能力。</p>
		<p>2.2 用户希望获得19理财网上述相关服务，需要: （1）自行配备上网所需设备， 包括个人电脑、调制解调器或其他必备上网装置。 （2）自行负担个人上网所支付的与此服务有关的电话费用、网络费用。</p>
		<p>2.3 基于19理财网所提供的相关服务的重要性，用户应同意：</p>
		<p> (1)提供详尽、准确的个人资料。<br/>
			(2)更新注册资料时，符合及时、详尽、准确的要求。<br/>
			(3)一旦成为19理财网的注册用户，19理财网将通过电子邮件不定期地向用户提供各类投融资信息及创新产品方面的信息和服务，用户将同意和接受并不视上述行为为垃圾邮件；<br/>
			(4)同时您的资料不得:<br/>
			1).具有欺诈性、虚假、不准确或具误导性;<br/>
			2).侵犯任何第三方著作权、专利权、商标权、商业秘密或其他专有权利或发表权或隐私权；<br/>
			3).违反任何适用的法律或法规；<br/>
			4).有侮辱或者诽谤他人，侵害他人合法权益的内容；<br/>
			5).有淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的内容；<br/>
			6).包含可能破坏、改变、删除、不利影响、秘密截取、未经授权而接触或征用任何系统、数据或个人资料的任何病毒/间谍软件或其他电脑程序；<br/>
			7).直接或间接链接至您无权链接或列入的任何网址或者内容。
		</p>

		<p>2.4用户隐私保护</p>
		<p> 19理财网不公开用户的注册信息给第三方（包括姓名、地址、电子邮箱和身份证号、密码等等），但以下情况例外：<br/>
			(1)用户授权19理财网透露这些信息。<br/>
			(2)用户因在19理财网上进行借款而与其他贷出者产生诉讼的，通过司法部门或行政部门依照法定程序要求19理财网提供相关数据，19理财网会积极配合并提供相关资料。<br/>
			(3)用户在19理财网进行交易过程中如与其它投资者产生纠纷，请求19理财网从中予以调解，经19理财网审核后，19理财网有权通过电子邮件向纠纷双方了解情况，并将所了解的情况通过电子邮件互相通知对方。<br/>
			(4)19理财网有权对注册数据及交易行为进行查阅，发现注册数据或交易行为中存在任何问题或怀疑，均有权向用户发出询问及要求改正的通知或者直接作出删除等处理。<br/>
			(5)经国家生效法律文书或行政处罚决定确认存在违法行为，或者19理财网有足够事实依据可以认定您存在违法或违反服务协议行为的，19理财网有权在平台及所在网站上以网络发布形式公布您的违法行为。<br/>
			(6)在使用19理财网服务时，网站有权接收并记录您的个人信息，包括但不限于IP地址、网站Cookie中的资料及您要求取用的网页记录等。<br/>
			(7)用户许可使用权授予本公司永久的、免费的、完整的许可使用权利（并且有权对该权利进行再授权），使我公司有权使用、复制、修改、发布、翻译、分发您的资料或制作其派生作品，以已知或日后开发的任何形式、媒体或技术，将您的资料纳入其他作品里。</p>

       <h3>3. 服务变更、中断或终止</h3> 
       <p>  3.1 鉴于网络服务的特殊性，用户同意19理财网有权随时变更、中断或终止部分或全部的网络服务。由19理财网在其网站上发布的相关活动，用户可以其真实信息于本网站注册参与。<br/>
			3.2 19理财网有权在必要时修改服务条款，19理财网服务条款一旦发生变动，将会在重要页面上提示修改内容。如果不同意所改动的内容，用户可以主动取消获得的服务。如果用户继续享用19理财网提供的服务，则视为接受服务条款的变动。19理财网保留随时修改或中断免费服务而不需提前通知用户的权利。19理财网行使修改或中断免费服务的权利，不需对用户或第三方负责。<br/>
			3.3 如发生下列任何一种情形，19理财网有权随时中断或终止向用户提供本协议项下的网络服务，而无需对用户或任何第三方承担任何责任：<br/>
			3.3.1 用户提供的个人资料不真实；<br/>
			3.3.2 用户违反本协议中规定的使用规则；<br/>
			3.3.3 用户在使用服务时未按规定向19理财网支付相应的服务费。
       </p>
		<h3>4. 权利限制</h3>
		<p> 4.1 用户对于其创作并通过19理财网（包括但不限于博客、论坛）上传到19理财网上的内容依法享有版权及其他相关合法权利。对于用户通过19理财网上传到19理财网站上可公开获取区域的任何内容，用户同意19理财网在全世界范围内具有免费的、永久性的、不可撤销的权利和许可，以使用、复制、修改、翻译、据以创作衍生作品、传播、表演和展示此等内容（整体或部分）。<br/>
			4.2 用户在使用19理财网服务过程中，必须遵循以下原则：<br/>
			4.2.1 遵守中国有关的法律和法规；<br/>
			4.2.2 遵守所有与网络服务有关的网络协议、规定和程序；<br/>
			4.2.3 不得为任何非法目的而使用19理财网络系统；<br/>
			4.2.4 不得以任何形式使用19理财网网络侵犯19理财网的商业利益，包括并不限于发布非经19理财网许可的商业广告；<br/>
			4.2.5 不得利用19理财网进行任何可能对互联网正常运转造成不利影响的行为；<br/>
			4.2.6 不得利用19理财网提供上传、展示或传播任何虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；<br/>
			4.2.7 不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；<br/>
			4.2.8 不得利用19理财网进行任何不利19理财网的行为；<br/>
			4.2.9 如发现任何非法使用用户帐号或帐号出现安全漏洞的情况，应立即通告19理财网。<br/>
			4.3 如用户在使用19理财网时违反任何上述规定，19理财网或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容等、暂停或终止用户使用19理财网的权利）以减轻用户不当行为造成的影响。侵害第三方权利的，由实施侵权行为的用户承担赔偿责任，触及刑法的，承担刑事责任。同时，19理财网保留追偿的权利。<br/>
			4.4 针对某些特定的19理财网网络服务使用通过各种方式（包括但不限于网页公告、电子邮件、短信提醒等）作出的任何声明、通知、警示等内容视为本协议的一部分，用户如使用该等19理财网服务，视为用户同意该等声明、通知、警示的内容。
		</p>
		
        <h3>5. 知识产权</h3>
		<p>5.1 19理财网提供的网络服务中包含的任何文本、图片、图形、音频和或视频资料均受版权、商标或其它财产所有权法律的保护，未经相关权利人同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。所有这些资料或资料的任何部分仅可作为私人和非商业用途而保存在某台计算机内。19理财网不就由上述资料产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误和遗漏或从中产生或由此产生的任何损害赔偿，以任何形式，向用户或任何第三方负责。</p>
		<h3>6. 隐私保护</h3>
		<p> 6.1 19理财网会尽最大的努力保护在各个环节中获知的用户资料，并承诺不对外公开或向第三方提供单个用户的注册资料，但下列情况除外：<br/>
			6.1.1 事先获得用户的明确授权。<br/>
			6.1.2 根据有关的法律法规要求。<br/>
			6.1.3 按照相关政府主管部门的要求。<br/>
			6.1.4 为维护社会公众的利益。<br/>
			6.1.5 为维护19理财网的合法权益。<br/>
			6.1.6 根据用户签订的其他协议约定可向第三人披露的。<br/>
			6.2 19理财网可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与19理财网同等的保护用户隐私的责任，则19理财网有权将用户的注册资料等提供给该第三方。<br/>
			6.3 在不透露单个用户隐私资料的前提下，19理财网有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。
		</p>
		<h3>7. 免责声明</h3>
		<p>
			用户对本服务协议的签署意味着用户同意自行承担对使用19理财网服务所产生的风险，19理财网对用户不承担任何责任。对所提供的网络服务，19理财网将尽最大努力，维护其及时性、安全性、准确性，但对此不作任何承诺。对于因不可抗力或19理财网不能控制的原因造成的网络服务中断或其它缺陷，19理财网不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。
		</p>
		<h3>8. 违约责任</h3>
		<p>
			8.1 如因19理财网违反有关法律、法规或本协议项下的任何条款而给用户造成损失，19理财网同意承担由此造成的损害赔偿责任。
			8.2 用户同意保障和维护19理财网及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给19理财网或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。
		</p>

		<h3>9. 通知送达协议</h3>
		<p>
			9.1 本协议项下19理财网对于用户所有的通知均可通过网页公告、电子邮件、手机短信或常规的信件传送等方式进行；通知于发送之日视为已送达收件人。
			9.2 用户对于19理财网的通知应当通过19理财网对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。
		</p>
		<h3>10. 争议的解决与管辖</h3>
		<p>
			10.1 本协议的订立、执行和解释及争议的解决均应适用中国法律并受中国法院管辖。<br/>
			10.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向19理财网所在地的人民法院提起诉讼。	
		</p>
        <h3>11. 其他</h3>
        <p>
	        11.1 本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。
			11.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
			11.3 本协议中的标题仅为方便而设，在解释本协议时应被忽略。	
        </p>
		</div>
		
	
	</div>
</template>

<script>
	export default {
		name: 'registerProtocol',
		data() {
			return {
				
			}
		},
		
		mounted(){
			
		},
		methods:{	
			goBack(){
				var that = this;
//				that.$router.go(-1);
				that.$router.push({
								path: '/register'
							});
				
			}
		}
	}
</script>

<style scoped="scoped">
	.contain{
		width: 89%;
		height: 100vh;
		margin:15px auto;
		overflow-y: visible;
	}
</style>
<style type="text/css">
	.pageView{
		overflow: scroll;
	}
	
</style>